Repository: kambalabs/KmbPuppet
Catalog: language/*.po
Languages: fr_fr

source: Day reports
fr_fr: Rapports du jour

source: Environments
fr_fr: Environnements

source: Groups
fr_fr: Groupes

source: Changes
fr_fr: Changements

source: Class
fr_fr: Classe

source: Group
fr_fr: Groupe

source: Add a group
fr_fr: Ajouter un groupe

source: A group allows to configure a set of Puppet classes and assigned them to a list of servers.
fr_fr: Un groupe permet de configurer un ensemble de classes Puppet et de les affecter à une liste de serveurs.

source: <h4>Warning !</h4><p>You should choose a default environment !</p>
fr_fr: <h4>Attention !</h4><p>Vous devez choisir un environnement par défaut !</p>

source: Environment %s has been successfully created !
fr_fr: L'environnement %s a bien été créé !

source: Environment %s could no be created on the puppet master
fr_fr: L'environnement %s n'a pas pu être créé sur le puppet master

source: Environment %s has been successfully updated !
fr_fr: L'environnement %s a bien été modifié !

source: Environment %s could no be updated on the puppet master
fr_fr: L'environnement %s n'a pas pu être modifié sur le puppet master

source: Environment %s has been successfully removed !
fr_fr: L'environnement %s a bien été supprimé !

source: Environment %s could no be removed on the puppet master
fr_fr: L'environnement %s n'a pas pu être supprimé sur le puppet master

source: '%s' is not a valid name (alphanumeric only) !
fr_fr: '%s' n'est pas un nom valide (alphanumérique uniquement) !

source: For obvious reasons, environment %s can't be the parent of %s !
fr_fr: Pour des raisons évidentes, l'environnement %s ne peut pas être le parent de %s !

source: Environment %s has already a child named %s !
fr_fr: L'environnement %s a déjà un enfant nommé %s !

source: Root environment %s already exists !
fr_fr: L'environnement racine %s existe déjà !

source: Initialization
fr_fr: Initialisation

source: include
fr_fr: inclus

source: exclude
fr_fr: exclus

source: You have been redirected to the last current revision of this group because last changes has been recently saved by <strong>%s</strong>. Please try again !
fr_fr: Vous avez été redirigé vers la dernière version courante de ce groupe car les derniers changements ont été récemment enregistrés par <strong>%s</strong>. Merci de réitérer votre action !

source: Unable to find associated template to the class
fr_fr: Impossible de trouver un template associé à la classe

source: Unable to find associated template to the parameter
fr_fr: Impossible de trouver un template associé au paramètre

source: Add parameter %s to class %s on group %s
fr_fr: Ajout du paramètre %s à la classe %s du groupe %s

source: You have been redirected to the last current revision of this group because last changes has been recently saved by %s.
fr_fr: Vous avez été redirigé vers la dernière version courante de ce groupe car les derniers changements ont été récemment enregistrés par %s.

source: An error occured while reaching PuppetDB !
fr_fr: Une erreur est survenue lors de l'appel à PuppetDB !

source: You have been redirected to the last current revision of this group because last changes has been recently saved by %s. Please try again !
fr_fr: Vous avez été redirigé vers la dernière version courante de ce groupe car les derniers changements ont été récemment enregistrés par %s. Merci de réitérer votre action !

source: Update group name %s to %s
fr_fr: Modification du nom du groupe %s en %s

source: Update include pattern of group %s
fr_fr: Modification du pattern d'inclusion du groupe %s

source: Update exclude pattern of group %s
fr_fr: Modification du pattern d'exclusion du groupe %s

source: You must choose a name for the new group
fr_fr: Vous devez choisir un nom pour le nouveau groupe

source: The group %s already exists in environment %s, choose a different name
fr_fr: Le groupe %s existe déjà dans l'environnement %s, choisissez un autre nom

source: Duplicate group %s to %s in %s environment
fr_fr: Dupliquer le groupe %s vers %s dans l'environnement %s

source: You've been redirect to %s environment
fr_fr: Vous avez été redirigé vers l'environnement %s

source: Remove group %s
fr_fr: Suppression du groupe %s

source: Group already has the class %s
fr_fr: Le groupe a déjà la classe %s

source: Unknown class %s
fr_fr: La classe %s n'existe pas

source: Add class %s to group %s
fr_fr: Ajout de la classe %s au groupe %s

source: Group doesn't have class %s
fr_fr: Le groupe n'a pas la classe %s

source: Remove class %s from group %s
fr_fr: Suppression de la classe %s du groupe %s

source: Class %s has been succesfully removed
fr_fr: La classe %s a bien été supprimée !

source: Update parameter %s of class %s on group %s
fr_fr: Modification du paramètre %s de la classe %s du groupe %s

source: Remove parameter %s of class %s on group %s
fr_fr: Suppression du paramètre %s de la classe %s du groupe %s

source: <h4>Warning !</h4><p>You have to select an environment first !</p>
fr_fr: <h4>Attention !</h4><p>Vous devez d'abord choisir un environnement !</p>

source: This environment is invalid, it has no current revision. Please contact administrator !
fr_fr: Cet environnement est invalide, il n'a pas de version courante. Merci de contacter un administrateur !

source: Update groups ordering
fr_fr: Modification de l'ordre des groupes

source: The group %s already exists in this environment !
fr_fr: Le groupe %s existe déjà dans cet environnement !

source: Create group %s
fr_fr: Création du groupe %s

source: The group %s has been successfully created !
fr_fr: Le groupe %s a bien été créé !

source: Parameters are in error, please check the template and the class definition
fr_fr: Certains paramètres sont en erreur, veuillez vérifier le template et la définition de la classe

source: You must enter a comment
fr_fr: Vous devez saisir un commentaire

source: You must enter a comment at most 256 characters long
fr_fr: Vous devez saisir un commentaire d'au plus 256 caractères de long

source: Warning !
fr_fr: Attention !

source: You haven't saved the changes you made %s !
fr_fr: Vous n'avez pas encore enregistré les changements que vous avez effectué %s !

source: <a href="%s">Click here</a> for more details.
fr_fr: <a href="%s">Cliquez ici</a> pour plus de détails.

source: I haven't saved the changes I made %s !
fr_fr: Je n'ai pas encore enregistré les changements que j'ai effectué %s !

source: %s days ago
fr_fr: il y a %s jours

source: yersterday
fr_fr: hier

source: %s hours ago
fr_fr: il y a %s heures

source: one hour ago
fr_fr: il y a une heure

source: %s minutes ago
fr_fr: il y a %s minutes

source: one minute ago
fr_fr: il y a une minute

source: %s seconds ago
fr_fr: il y a %s secondes

source: one second ago
fr_fr: il y a une seconde

source: Following parameters are required : %value%
fr_fr: Les paramètres suivant sont requis : %value%

source: This parameter does not exists in the class template
fr_fr: Ce paramètre n'existe pas dans le template de classe

source: Hour
fr_fr: Heure

source: Server
fr_fr: Serveur

source: Title
fr_fr: Titre

source: boolean
fr_fr: booléen

source: free entry
fr_fr: saisie libre

source: string
fr_fr: chaîne

source: text
fr_fr: texte

source: password
fr_fr: mot de passe

source: predefined list
fr_fr: liste prédéfinie

source: editable hashtable
fr_fr: hashtable éditable

source: Group %s
fr_fr: Groupe %s

source: Add a class
fr_fr: Ajouter une classe

source: Remove class
fr_fr: Supprimer la classe

source: You are about to remove <strong>%s</strong> class.
fr_fr: Vous êtes sur le point de supprimer la classe <strong>%s</strong>.

source: View class parameters
fr_fr: Voir les paramètres de la classe

source: Error
fr_fr: Erreur

source: No classes available !
fr_fr: Aucune classe disponible !

source: Select a class
fr_fr: Choisir une classe

source: Cancel
fr_fr: Annuler

source: Add
fr_fr: Ajouter

source: Confirm Remove
fr_fr: Confirmation de suppression

source: Do you want to proceed ?
fr_fr: Êtes-vous sûr de vouloir continuer ?

source: Remove
fr_fr: Supprimer

source: Class %s
fr_fr: Classe %s

source: Add a parameter
fr_fr: Ajouter un paramètre

source: Collapse all
fr_fr: Tout replier

source: Expand all
fr_fr: Tout déplier

source: Help
fr_fr: Aide

source: Click on the servers count to preview the list of assigned servers.
fr_fr: Cliquez sur le nombre de serveurs pour prévisualiser la liste des serveurs affectés.

source: View the detail configuration of a class by clicking on its name.
fr_fr: Accéder au détail de la configuration d'une classe en cliquant sur son nom.

source: Click on a parameter or a value to update it.
fr_fr: Cliquer sur un paramètre ou une valeur pour le (ou la) modifier.

source: back
fr_fr: retour

source: Compare environments
fr_fr: Comparer les environnements

source: Compare
fr_fr: Comparer

source: Installed modules
fr_fr: Modules installés

source: No differences
fr_fr: Aucune différence

source: Groups ordering
fr_fr: Ordre des groupes

source: Groups content
fr_fr: Contenu des groupes

source: Insert
fr_fr: Ajout

source: Replace
fr_fr: Modification

source: Delete
fr_fr: Suppression

source: Add a child to environment
fr_fr: Ajouter un environnement enfant

source: Duplicate environment
fr_fr: Dupliquer l'environnement

source: Update environment
fr_fr: Modifier l'environnement

source: Manage permissions
fr_fr: Gérer les droits d'accès

source: Remove environment
fr_fr: Supprimer l'environnement

source: You are about to remove %s environment, this procedure is irreversible.
fr_fr: Vous êtes sur le point de supprimer l'environnement %s, cette action est irréversible.

source: Create an environment
fr_fr: Créer un environnement

source: You have to choose a parent and a name for this environment.
fr_fr: Vous devez choisir un parent et un nom pour le nouvel environnement.

source: The environment will automatically inherits of all the modules (in the same version) presents in each of its ancestors.
fr_fr: L'environnement va automatiquement hériter de tous les modules (dans la même version) présents dans chacun de ses ancêtres.

source: Select a parent
fr_fr: Sélectionner un parent

source: Select an environment
fr_fr: Choisir un environnement

source: Choose a name
fr_fr: Choisir un nom

source: The name must be <strong>alphanumeric</strong> only ! All special characters are forbidden (including underscore).
fr_fr: Le nom doit impérativement être <strong>alphanumérique</strong> ! Tout caractère spécial est interdit (y compris l'underscore).

source: Save
fr_fr: Enregistrer

source: Compare two environments
fr_fr: Comparer deux environnements

source: You have to choose both environments you want to compare.
fr_fr: Vous devez choisir les deux environnements que vous souhaitez comparer.

source: 1st environment
fr_fr: 1er environnement

source: 2nd environment
fr_fr: 2ème environnement

source: Duplicate an environment
fr_fr: Dupliquer un environnement

source: REMINDER
fr_fr: RAPPEL

source: The environment (and his children) will be duplicate within the same parent. The new environments will have the same configuration (groups and installed modules) than their clone.
fr_fr: L'environnement (et ses enfants) sera dupliqué au sein du même parent. Les nouveaux environnements auront la même configuration (groupes et modules installés) que leur clone.

source: Note that if the environment has unsaved changes, it will not be duplicated. The duplication is based only on the active configuration.
fr_fr: Notez que si l'environnement a des changements en cours, ils ne seront pas dupliqués. La duplication ne se base que sur la version active.

source: Update an environment
fr_fr: Modifier un environnement

source: Default environment
fr_fr: Environnement par défaut

source: All servers which has not already been assigned to an environment will be automatically assigned to the default environment.
fr_fr: Tous les serveurs qui n'ont pas encore été affecté à un environnement se verront automatiquement affecté à l'environnement par défaut.

source: Mark this environment as default
fr_fr: Choisir cet environnement comme environnement par défaut

source: A <strong>user</strong> can read his environments, their ancestors and children.
fr_fr: Un <strong>utilisateur</strong> peut lire ses environnements, leurs ancêtres et enfants.

source: An <strong>admin</strong> can read his environments and their ancestors, and manage their children.
fr_fr: Un <strong>admin</strong> peut lire ses environnements et leurs ancêtres, et peut gérer leurs enfants.

source: Select users
fr_fr: Choisir des utilisateurs

source: Name
fr_fr: Nom

source: Add an environment
fr_fr: Ajouter un environnement

source: Search
fr_fr: Rechercher

source: Filter the list by typing your terms in the search field, then click on the button %s.
fr_fr: Pour filtrer la liste, saisissez votre recherche dans le champ prévu à cet effet puis cliquez sur le bouton %s.

source: You can expand / collapse the children of each environment by clicking on the buttons %s.
fr_fr: Vous pouvez plier / déplier les enfants de chaque environnement en cliquant sur les boutons %s.

source: Click on %s to add a child to the environment.
fr_fr: Cliquer sur %s pour ajouter un enfant à l'environnement.

source: Remove the environment by clicking on %s.
fr_fr: Supprimer l'environnement en cliquant sur %s.

source: Click on %s to update the name and/or the parent of the environment.
fr_fr: Cliquer sur %s pour modifier le nom et/ou le parent de l'environnement.

source: Manage permissions by clicking on %s.
fr_fr: Gérer les droits d'accès en cliquant sur %s.

source: Submit
fr_fr: Valider

source: New entry
fr_fr: Nouvelle entrée

source: New value
fr_fr: Nouvelle valeur

source: Remove entry
fr_fr: Supprimer l'entrée

source: You are about to remove <strong>%s</strong> parameter.
fr_fr: Vous êtes sur le point de supprimer le paramètre <strong>%s</strong>.

source: Detailed informations on group
fr_fr: Informations détaillées du groupe

source: Preview
fr_fr: Prévisualiser

source: servers
fr_fr: serveurs

source: Servers list
fr_fr: Liste des serveurs

source: Servers count
fr_fr: Nombre de serveurs

source: Filter list
fr_fr: Filtrer la liste

source: Remove value
fr_fr: Supprimer la valeur

source: You are about to remove a value of <strong>%s</strong> parameter.
fr_fr: Vous êtes sur le point de supprimer une valeur du paramètre <strong>%s</strong>.

source: click to update
fr_fr: cliquer pour modifier

source: no value
fr_fr: aucune valeur

source: Sort groups
fr_fr: Trier les groupes

source: Remove group
fr_fr: Supprimer le groupe

source: You are about to remove <strong>%s</strong> group.
fr_fr: Vous êtes sur le point de supprimer le groupe <strong>%s</strong>.

source: Duplicate group
fr_fr: Dupliquer le groupe

source: You are about to duplicate <strong>%s</strong> group.
fr_fr: Vous êtes sur le point de dupliquer le groupe <strong>%s</strong>.

source: View group
fr_fr: Consulter le groupe

source: No groups
fr_fr: Aucun groupe

source: Duplicate a group
fr_fr: Dupliquer un groupe

source: You can duplicate a group in the current environment or in any other environment.
fr_fr: Vous pouvez dupliquer un groupe dans l'environnement courant ou dans n'importe quel autre environnement.

source: Here is the list of groups on environment <strong>%s</strong>.
fr_fr: Voici la liste des groupes de l'environnement <strong>%s</strong>.

source: You can see the details of a group by clicking on its name.
fr_fr: Accéder au détail d'un groupe en cliquant sur son nom.

source: <strong>Caution</strong> : The order of groups is important ! When a server is associated to two groups which implements the same class, it's the class configuration of the lower group that will be sustained.
fr_fr: <strong>Attention</strong> : L'ordre des groupes est important ! Quand un serveur est associé à deux groupes implémentant la même classe, c'est la configuration de la classe du groupe le plus bas qui sera retenue.

source: You can sort the groups by grabing the icon <span class="glyphicon glyphicon-th grab"></span>.
fr_fr: Vous pouvez trier les groupes en cliquant sur l'icône <span class="glyphicon glyphicon-th grab"></span>.

source: Modules of %s environment
fr_fr: Modules de l'environnement %s

source: No modules
fr_fr: Aucun module

source: View module
fr_fr: Consulter le module

source: This module overrides the version installed in the parent environment
fr_fr: Ce module surcharge la version installée dans l'environnement parent

source: Inherited modules
fr_fr: Modules hérités

source: View modules list of %s environment
fr_fr: Voir la liste des modules de l'environnement %s

source: View parent's modules
fr_fr: Voir les modules du parent

source: Here is the list of installed modules on environment <strong>%s</strong>.
fr_fr: Voici la liste des modules installés dans l'environnement <strong>%s</strong>.

source: When version of a module is red <span class="label label-danger">1.0.0</span>, it means that at least one of its classes is in error.
fr_fr: La version d'un module est rouge <span class="label label-danger">1.0.0</span> lorsqu'au moins une de ses classes est en erreur.

source: <strong>Note</strong> : The list of modules is refreshed every 5 minutes, but you can clear the cache manually by clicking on your name in the top right of the page.
fr_fr: <strong>Note</strong> : La liste des modules est mise à jour toutes les 5 minutes, cependant vous pouvez vider le cache manuellement en cliquant sur votre nom en haut à droite de la page.

source: required
fr_fr: requis

source: multiple values
fr_fr: valeurs multiples

source: values
fr_fr: valeurs

source: error
fr_fr: erreur

source: Detailed informations on class
fr_fr: Informations détaillées de la classe

source: Parameters of class %s
fr_fr: Paramètres de la classe %s

source: No parameters !
fr_fr: Pas de paramètre !

source: required parameter
fr_fr: paramètre requis

source: Documention should be provided in the puppetdoc of the class.
fr_fr: Il est conseillé de fournir une documentation dans la puppetdoc de la classe.

source: Detailed informations on module
fr_fr: Informations détaillées du module

source: author
fr_fr: auteur

source: license
fr_fr: licence

source: Classes of module %s
fr_fr: Classes du module %s

source: View more details on class
fr_fr: Voir les détails de la classe

source: project page
fr_fr: page du projet

source: Summary
fr_fr: Résumé

source: Changes history
fr_fr: Historique des changements

source: Import revision
fr_fr: Importer une version

source: Warning ! You are about to import a revision. It will be immediately accessible by Puppet, all current changes will be definitively lost.
fr_fr: Attention ! Vous êtes sur le point d'importer une version. Elle sera immédiatement accessible par Puppet, tous les changements en cours seront définitivement perdus.

source: Import
fr_fr: Importer

source: Compare selected revisions
fr_fr: Comparer les versions sélectionnées

source: Current changes
fr_fr: Changements en cours

source: Save current changes
fr_fr: Enregistrer les changements en cours

source: Warning ! You are about to save current changes, it will be immediately accessible by Puppet.
fr_fr: Attention ! Vous êtes sur le point de sauver les changements en cours, ils seront immédiatement accessibles par Puppet.

source: Cancel current changes
fr_fr: Annuler les changements en cours

source: You are about to remove all current changes.
fr_fr: Vous êtes sur le point de supprimer tous les changements en cours.

source: More details on current changes
fr_fr: Plus de détails sur les changements en cours

source: current revision
fr_fr: version en cours

source: Changes list
fr_fr: Liste des changements

source: User
fr_fr: Utilisateur

source: No current changes
fr_fr: Aucun changement en cours

source: Restore revision
fr_fr: Restaurer une version

source: Warning ! You are about to restore a revision. It will be immediately accessible by Puppet, all current changes will be definitively lost.
fr_fr: Attention ! Vous êtes sur le point de rétablir une version. Elle sera immédiatement accessible par Puppet, tous les changements en cours seront définitivement perdus.

source: Remove revision
fr_fr: Supprimer la version

source: You are about to remove a revision.
fr_fr: Vous êtes sur le point de supprimer une version.

source: Export revision
fr_fr: Exporter la version

source: More details on revision
fr_fr: Plus de détails sur la version

source: active revision
fr_fr: version active

source: No changes
fr_fr: Aucun changement

source: Activate a revision
fr_fr: Activer une version

source: Enter a comment
fr_fr: Saisir un commentaire

source: Import a revision
fr_fr: Importer une version

source: Don't forget to consult logs before (by clicking on icon&nbsp;<i class="glyphicon glyphicon-search lightgrey"></i>) to be aware of what you are removing.
fr_fr: N'oubliez pas de consulter les logs avant (en cliquant sur l'icône&nbsp;<i class="glyphicon glyphicon-search lightgrey"></i>) pour bien être conscient de ce que vous supprimez.

source: Click on <i class="glyphicon glyphicon-ok green"></i> to save current changes.
fr_fr: Cliquez sur <i class="glyphicon glyphicon-ok green"></i> pour enregistrer les changements en cours.

source: You can restore a revision by clicking on <i class="glyphicon glyphicon-repeat blue"></i>, or remove it by clicking on <i class="glyphicon glyphicon-remove red"></i>.
fr_fr: Vous pouvez restaurer une version en cliquant sur <i class="glyphicon glyphicon-repeat blue"></i>, ou la supprimer en cliquant sur <i class="glyphicon glyphicon-remove red"></i>.

source: Click on <i class="glyphicon glyphicon-export grey"></i> to export a revision.
fr_fr: Cliquez sur <i class="glyphicon glyphicon-export grey"></i> pour exporter une version.

source: View all logs of a revision by clicking on <i class="glyphicon glyphicon-search grey"></i>.
fr_fr: Consultez les logs d'une version en cliquant sur <i class="glyphicon glyphicon-search grey"></i>.

source: Assigned groups
fr_fr: Groupes affectés

source: Current configuration
fr_fr: Configuration en cours

source: Active configuration
fr_fr: Configuration active

source: Groups of %s environment
fr_fr: Groupes de l'environnement %s

source: Puppet configuration
fr_fr: Configuration Puppet
